//В домашнем задании нам нужно спроектировать логику страницы логина (готовая форма логина login_form.zip -
//можете использовать её, можете на её основе сделать свою или создать полностью свою)
//Должна быть логика проверки логина на стороне сервлета (где хранить данные - на ваше усмотрение.
//Это может быть БД, xml, просто файл, коллекция и т.п.)
//При успешной попытке логина должна открываться страница с приветствием в виде:
//Привет, <NAME> (вместо <NAME> должно быть имя вошедшего пользователя) и/или списком книг
//В случае если такого логина нет, должна открываться страница с формой регистрации
//После успешной регистрации должна открываться страница из пункта 2
//О пользователе должны храниться следующие данные: логин, пароль, имя пользователя
//Данные пользователя можно хранить в контексте приложения, можно в сессии (лучше в сессии).
//Так же хорошо было бы сделать кнопку LOGOUT, которая будет находится на странице приветствия.
//По нажатию на эту кнопку данные пользователя должны удаляться из контекста сессии или приложения и
//пользователь должен снова попадать на страницу логина.


